[metadata]
creation_date = "2020/02/18"
maturity = "production"
minimum_kibana_version = "7.13"
updated_date = "2021/03/03"
[[metadata.changelog]]
message = "_version_locked_"
date = "2021/03/03"
pull_request = ""
sha256 = "a999fad6cc665af1661c4236b341868f37050cba2acee4f448e15c4b91dbd9f7"


[rule]
author = ["Elastic"]
description = """
The whoami application was executed on a Linux host. This is often used by tools and persistence mechanisms to test for
privileged access.
"""
false_positives = [
    """
    Security testing tools and frameworks may run this command. Some normal use of this command may originate from
    automation tools and frameworks.
    """,
]
from = "now-9m"
index = ["auditbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "User Discovery via Whoami"
risk_score = 21
rule_id = "120559c6-5e24-49f4-9e30-8ffe697df6b9"
severity = "low"
tags = ["Elastic", "Host", "Linux", "Threat Detection", "Discovery"]
type = "query"

query = '''
event.category:process and event.type:(start or process_started) and process.name:whoami
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1033"
name = "System Owner/User Discovery"
reference = "https://attack.mitre.org/techniques/T1033/"


[rule.threat.tactic]
id = "TA0007"
name = "Discovery"
reference = "https://attack.mitre.org/tactics/TA0007/"

